
&НаКлиенте
Процедура ВыполнитьРегистрацию(Команда)
	Если ЭтаФорма.Логин = "" Тогда
		Сообщить("Введите логин пользователя!");
		Возврат;
	КонецЕсли;
	Если ЭтаФорма.Телефон = "" Тогда
		Сообщить("Введите номер телефона пользователя!");
		Возврат;
	КонецЕсли; 
	
	Успех = Неопределено;
	ТекстСообщения = "";
	
	ВыполнитьРегистрациюНаСервере(Успех,ТекстСообщения); 
	
	Если Успех Тогда
		АутентификацияИАвторизация.ВыполнитьАутентификацию(ЭтаФорма.Логин);
		ЗавершитьРаботуСистемы(Ложь, Истина);
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	//ЗавершитьРаботуСистемы(Ложь, Истина);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРегистрациюНаСервере(Успех,ТекстСообщения)
	 
	//Создаем JSON
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Наименование", ЭтаФорма.Логин);
	СтруктураРеквизитовФормы.Вставить("Телефон", ЭтаФорма.Телефон);
	
	СтруктураРеквизитовДокументаJSON = ОбменСОсновнойБазой.ПолучитьТекстJSON(СтруктураРеквизитовФормы);
	
	//Отправляем пользователя в основную базу
	ПользовательУспешноОтправлен = Регистрация.ОтправитьПользователяВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON);
	Если ПользовательУспешноОтправлен Тогда        		
		Успех = Истина;
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст    = "Пользователь успешно зарегистрирован!";
	Иначе
		Успех = Ложь;
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст    = "Не удалось зарегистрировать пользователя!";
	КонецЕсли; 
	
	ТекстСообщения = СообщениеПользователю.Текст;
	
КонецПроцедуры
