
Функция ОтправитьПользователяВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON) Экспорт    
    Соединение = Новый HTTPСоединение("192.168.0.112",,"MobileClient");
    HTTPЗапросЗапрос     = Новый HTTPЗапрос("SalonKrasoti/hs/users/postUser");
    HTTPЗапросЗапрос.УстановитьТелоИзСтроки(СтруктураРеквизитовДокументаJSON);
    Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапросЗапрос);
    
    Если Ответ.КодСостояния = 200 Тогда        
        УспешноОтправлен = Истина;
    Иначе
        УспешноОтправлен = Ложь;
    КонецЕсли;

    Возврат УспешноОтправлен;    
КонецФункции
