
&НаСервере
Процедура ЗаписатьсяНаСервере(Успех,ТекстСообщения)
	ЗаписьКлиента = Документы.ЗаписьКлиента.СоздатьДокумент();
	ЗаписьКлиента.Дата        	= НачалоМинуты(Объект.ДатаЗаписи);
	ЗаписьКлиента.Сотрудник 	= Объект.Сотрудник;
	
	СтрокаУслуги = ЗаписьКлиента.Услуги.Добавить();
	СтрокаУслуги.Услуга        	= Объект.Услуга;
	СтрокаУслуги.Стоимость    	= Объект.Стоимость;
	
	//ЗаписьКлиента.Записать(); 
	
	//Создаем JSON
	СтруктураРеквизитовДокумента = Новый Структура;
	СтруктураРеквизитовДокумента.Вставить("ДатаЗаписи", Объект.ДатаЗаписи);
	СтруктураРеквизитовДокумента.Вставить("Сотрудник", Строка(Объект.Сотрудник));
	СтруктураРеквизитовДокумента.Вставить("GUIDПользователя", ПараметрыСеанса.ТекущийПользователь.ВнешнийGUID);
	
	МассивУслуг = Новый Массив;
	
	Услуга = Новый Структура;
	Услуга.Вставить("Услуга", Строка(Объект.Услуга));
	Услуга.Вставить("Цена", Объект.Стоимость);
	Услуга.Вставить("Количество", 1);
	Услуга.Вставить("Сумма", Объект.Стоимость);
	
	МассивУслуг.Добавить(Услуга);
	СтруктураРеквизитовДокумента.Вставить("МассивУслуг", МассивУслуг);
	
	СтруктураРеквизитовДокументаJSON = ОбменСОсновнойБазой.ПолучитьТекстJSON(СтруктураРеквизитовДокумента);
	
	//Отправляем документ Запись в основную базу
	ДокументУспешноОтправлен = ОбменСОсновнойБазой.ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON);
	Если ДокументУспешноОтправлен Тогда        
		ЗаписьКлиента.Записать(РежимЗаписиДокумента.Проведение);
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("Вы записаны на услугу %1 к мастеру %2 на дату %3", 
		Объект.Услуга, Объект.Сотрудник, Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'"));                                    
		СообщениеПользователю.Сообщить();
		
		//Очистим реквизиты формы после успешной отправки документа
		Объект.ДатаЗаписи    = '00010101';
		Объект.Сотрудник    = Справочники.Сотрудники.ПустаяСсылка();
		Объект.Услуга        = Справочники.Услуги.ПустаяСсылка();
		Объект.Стоимость  = 0;
		
		Успех = Истина;
	Иначе    
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст    = "Не удалось отправить Запись!";
		//СообщениеПользователю.Сообщить();
	КонецЕсли; 
	
	ТекстСообщения = СообщениеПользователю.Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура Записаться(Команда)
	Успех = Неопределено;
	ТекстСообщения = ""; 
	Если ЗначениеЗаполнено(Объект.ДатаЗаписи) Тогда
		Если Объект.ДатаЗаписи < ТекущаяДата() Тогда
			Успех = Ложь;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Дата записи не может быть раньше текущей даты! Пожалуйста, измените дату записи!";
			СообщениеПользователю.Сообщить();	
		Иначе
			ЗаписатьсяНаСервере(Успех,ТекстСообщения);
			Если Успех Тогда
				Оповещение = Новый ОписаниеОповещения("ПереходКСписку", ЭтаФорма);
				ПоказатьПредупреждение(Оповещение, ТекстСообщения);
			Иначе
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = ТекстСообщения;
				СообщениеПользователю.Сообщить();	
			КонецЕсли;
		КонецЕсли;
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Пожалуйста, укажите дату записи!";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПереходКСписку(ТекстСообщения) Экспорт
	ОткрытьФорму("Документ.ЗаписьКлиента.ФормаСписка");
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуУслуги(Услуга)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Услуги.Стоимость КАК Стоимость
	|ИЗ
	|	Справочник.Услуги КАК Услуги
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка"; 
	Запрос.УстановитьПараметр("Ссылка",Услуга);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Стоимость;
КонецФункции 

&НаКлиенте
Процедура УслугаПриИзменении(Элемент) 
	Если ЗначениеЗаполнено(Объект.Услуга) Тогда
		Объект.Стоимость = ПолучитьЦенуУслуги(Объект.Услуга);
	КонецЕсли;
КонецПроцедуры
