   Функция JSONВОбъект(СтрокаЧтения) Экспорт
	   ЧтениеДанных = Новый ЧтениеJSON;
	   ЧтениеДанных.УстановитьСтроку(СтрокаЧтения);            
	   Объект = ПрочитатьJSON(ЧтениеДанных);    
	   Возврат Объект;
   КонецФункции 
   
   Процедура АвторизоватьПользователя(ДанныеПользователя) Экспорт
    
    НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    НовыйПользовательИБ.Имя = ДанныеПользователя.name;
    НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
    НовыйПользовательИБ.Записать();
    
    ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ДанныеПользователя.name);
    Если ТекущийПользователь.Пустая() Тогда
        НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
        НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
        НовыйПользователь.ВнешнийGUID = ДанныеПользователя.code;  
        НовыйПользователь.Наименование = ДанныеПользователя.name;
        НовыйПользователь.Записать(); 
        ТекущийПользователь = НовыйПользователь.Ссылка; 
    КонецЕсли;
    
    ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;    
КонецПроцедуры  

Функция ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON) Экспорт    
    Соединение = Новый HTTPСоединение("192.168.0.112",,"MobileClient");
    HTTPЗапросЗапрос     = Новый HTTPЗапрос("SalonKrasoti/hs/customerOrders/createOrder");
    HTTPЗапросЗапрос.УстановитьТелоИзСтроки(СтруктураРеквизитовДокументаJSON);
    Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапросЗапрос);
    
    Если Ответ.КодСостояния = 200 Тогда        
        УспешноОтправлен = Истина;
    Иначе
        УспешноОтправлен = Ложь;
    КонецЕсли;

    Возврат УспешноОтправлен;    
КонецФункции

Функция ПолучитьТекстJSON(ДанныеJSON) Экспорт    
    ЗаписьJSON = Новый ЗаписьJSON;
    ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
    ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
    ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);    
    Возврат ЗаписьJSON.Закрыть();
КонецФункции 
