Процедура ВыполнитьАутентификацию(Логин) Экспорт    
    Соединение    = Новый HTTPСоединение("192.168.0.112",,"MobileClient");
    Запрос        = Новый HTTPЗапрос("SalonKrasoti/hs/users/getUser?username="+Логин);
    Ответ        = Соединение.Получить(Запрос);    
    Если Ответ.КодСостояния = 200 Тогда
        МассивДанныхПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
        Если МассивДанныхПользователя.Количество() = 0 Тогда 
            Сообщить("По логину " + Логин +" пользователь не найден!");
        ИначеЕсли ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда 
            ОбменСОсновнойБазой.АвторизоватьПользователя(МассивданныхПользователя[0]);
        КонецЕсли;
    Иначе
        Сообщить("При попытке аутентификации произошла ошибка!");
    КонецЕсли;    
КонецПроцедуры

Процедура Разлогиниться() Экспорт
    Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда
        ПользователиИнформационнойБазы.ТекущийПользователь().Удалить();    
    КонецЕсли;
КонецПроцедуры